test-resources/golden/TestSamlAdfsAuthenticateWithCookie_REQ_adfs_services_trust_13_usernamemixed.golden

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
	xmlns:a="http://www.w3.org/2005/08/addressing" 
	xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</a:Action>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">REPLACED</a:To>
		<o:Security s:mustUnderstand="1" 
			xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="_0">
				<u:Created>REPLACED</u:Created>
				<u:Expires>REPLACED</u:Expires>
			</u:Timestamp>
			<o:UsernameToken>
				<o:Username>fakeUser</o:Username>
				<o:Password o:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">fakePass</o:Password>
			</o:UsernameToken>
		</o:Security>
	</s:Header>
	<s:Body>
		<trust:RequestSecurityToken xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
			<wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
				<a:EndpointReference>
					<a:Address>https://192.168.1.109/cloud/org/my-org/saml/metadata/alias/vcd</a:Address>
				</a:EndpointReference>
			</wsp:AppliesTo>
			<trust:KeySize>0</trust:KeySize>
			<trust:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
			<i:RequestDisplayToken xml:lang="en" 
				xmlns:i="http://schemas.xmlsoap.org/ws/2005/05/identity" />
			<trust:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</trust:RequestType>
			<trust:TokenType>http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</trust:TokenType>
		</trust:RequestSecurityToken>
	</s:Body>
</s:Envelope>